JayHeng/RT-UFL/test/unittest/MIMXRT1189/startup_MIMXRT1189_cm33.s
; -------------------------------------------------------------------------
;  @file:    startup_MIMXRT1189_cm33.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MIMXRT1189_cm33
;  @version: 0.1
;  @date:    2021-3-9
;  @build:   b211130
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2021 NXP
; All rights reserved.
;
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

__iar_init$$done:              ; The vector table is not needed
                      ; until after copy initialization is done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     0                                             ;Reserved
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     TMR1_IRQHandler                               ;TMR1 interrupt
        DCD     DGB_TRACE_IRQHandler                          ;Debug Tarce interrupt
        DCD     CTI_TRIGGER_OUT_CM7_IRQHandler                ;CTI trigger outputs from CM7
        DCD     CTI_TRIGGER_OUT_CM33_IRQHandler               ;CTI trigger outputs from CM33
        DCD     TMR5_IRQHandler                               ;TMR5 interrupt
        DCD     TMR6_IRQHandler                               ;TMR6 interrupt
        DCD     TMR7_IRQHandler                               ;TMR7 interrupt
        DCD     TMR8_IRQHandler                               ;TMR8 interrupt
        DCD     CAN1_IRQHandler                               ;CAN1 interrupt
        DCD     CAN1_ERROR_IRQHandler                         ;CAN1 error interrupt
        DCD     GPIO1_0_IRQHandler                            ;GPIO1 interrupt 0
        DCD     GPIO1_1_IRQHandler                            ;GPIO1 interrupt 1
        DCD     Reserved28_IRQHandler                         ;Reserved interrupt
        DCD     LPI2C1_IRQHandler                             ;LPI2C1 interrupt
        DCD     LPI2C2_IRQHandler                             ;LPI2C2 interrupt
        DCD     LPIT1_IRQHandler                              ;LPIT1 interrupt
        DCD     LPSPI1_IRQHandler                             ;LPSPI1 interrupt
        DCD     LPSPI2_IRQHandler                             ;LPSPI2 interrupt
        DCD     LPTMR1_IRQHandler                             ;LPTMR1 interrupt
        DCD     LPUART1_IRQHandler                            ;LPUART1 interrupt
        DCD     LPUART2_IRQHandler                            ;LPUART2 interrupt
        DCD     Reserved37_IRQHandler                         ;Reserved interrupt
        DCD     Reserved38_IRQHandler                         ;Reserved interrupt
        DCD     PWM1_FAULT_IRQHandler                         ;PWM1 fault or reload error interrupt
        DCD     PWM1_0_IRQHandler                             ;PWM1 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM1_1_IRQHandler                             ;PWM1 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM1_2_IRQHandler                             ;PWM1 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM1_3_IRQHandler                             ;PWM1 capture 3, compare 3, or reload 3 interrupt
        DCD     Reserved44_IRQHandler                         ;Reserved interrupt
        DCD     Reserved45_IRQHandler                         ;Reserved interrupt
        DCD     Reserved46_IRQHandler                         ;Reserved interrupt
        DCD     Reserved47_IRQHandler                         ;Reserved interrupt
        DCD     Reserved48_IRQHandler                         ;Reserved interrupt
        DCD     Reserved49_IRQHandler                         ;Reserved interrupt
        DCD     Reserved50_IRQHandler                         ;Reserved interrupt
        DCD     Reserved51_IRQHandler                         ;Reserved interrupt
        DCD     TPM1_IRQHandler                               ;TPM1 interrupt
        DCD     TPM2_IRQHandler                               ;TPM2 interrupt
        DCD     RTWDOG1_IRQHandler                            ;RTWDOG1 interrupt
        DCD     RTWDOG2_IRQHandler                            ;RTWDOG2 interrupt
        DCD     Reserved56_IRQHandler                         ;Reserved interrupt
        DCD     PDM_HWVAD_EVENT_IRQHandler                    ;HWVAD event interrupt
        DCD     PDM_HWVAD_ERROR_IRQHandler                    ;HWVAD error interrupt
        DCD     PDM_EVENT_IRQHandler                          ;PDM event interrupt
        DCD     PDM_ERROR_IRQHandler                          ;PDM error interrupt
        DCD     SAI1_IRQHandler                               ;SAI interrupt
        DCD     CACHE_ECC_IRQHandler                          ;M33 PS Tag/Data Parity Error
        DCD     M33_TCM_ECC_IRQHandler                        ;M33 TCM ECC interrupt
        DCD     M33_TCM_ERROR_IRQHandler                      ;M33 TCM Error interrupt
        DCD     M7_TCM_ECC_IRQHandler                         ;M7 TCM ECC interrupt
        DCD     M7_TCM_ERROR_IRQHandler                       ;M7 TCM Error interrupt
        DCD     CAN2_IRQHandler                               ;CAN2 interrupt
        DCD     CAN2_ERROR_IRQHandler                         ;CAN2 error interrupt
        DCD     FLEXIO1_IRQHandler                            ;FLEXIO1 interrupt
        DCD     FLEXIO2_IRQHandler                            ;FLEXIO2 interrupt
        DCD     FLEXSPI1_IRQHandler                           ;FLEXSPI1 interrupt
        DCD     FLEXSPI2_IRQHandler                           ;FLEXSPI2 interrupt
        DCD     GPIO2_0_IRQHandler                            ;GPIO2 interrupt 0
        DCD     GPIO2_1_IRQHandler                            ;GPIO2 interrupt 1
        DCD     GPIO3_0_IRQHandler                            ;GPIO3 interrupt 0
        DCD     GPIO3_1_IRQHandler                            ;GPIO3 interrupt 1
        DCD     Reserved77_IRQHandler                         ;Reserved interrupt
        DCD     LPI2C3_IRQHandler                             ;LPI2C3 interrupt
        DCD     LPI2C4_IRQHandler                             ;LPI2C4 interrput
        DCD     LPIT2_IRQHandler                              ;LPIT2 interrupt
        DCD     LPSPI3_IRQHandler                             ;LPSPI3 interrupt
        DCD     LPSPI4_IRQHandler                             ;LPSPI4 interrupt
        DCD     LPTMR2_IRQHandler                             ;LPTMR2 interrupt
        DCD     LPUART3_IRQHandler                            ;LPUART3 interrupt
        DCD     LPUART4_IRQHandler                            ;LPUART4 interrupt
        DCD     LPUART5_IRQHandler                            ;LPUART5 interrupt
        DCD     LPUART6_IRQHandler                            ;LPUART6 interrupt
        DCD     ASRC_IRQHandler                               ;ASRC interrupt
        DCD     BBNSM_IRQHandler                              ;BBNSM iterrupt
        DCD     SYS_CTRL1_IRQHandler                          ;System Counter compare interrupt 0 and 1
        DCD     TPM3_IRQHandler                               ;TPM3 interrupt
        DCD     TPM4_IRQHandler                               ;TPM4 interrupt
        DCD     TPM5_IRQHandler                               ;TPM5 interrupt
        DCD     TPM6_IRQHandler                               ;TPM6 interrupt
        DCD     RTWDOG3_IRQHandler                            ;RTWDOG3 interrupt
        DCD     RTWDOG4_IRQHandler                            ;RTWDOG4 interrupt
        DCD     RTWDOG5_IRQHandler                            ;RTWDOG5 interrupt
        DCD     Reserved98_IRQHandler                         ;Reserved interrupt
        DCD     TEMPSENSOR_IRQHandler                         ;TempSensor alarm
        DCD     BBSM_ALARM_IRQHandler                         ;BBSM alarm interrupt
        DCD     Reserved101_IRQHandler                        ;Reserved interrupt
        DCD     USDHC1_IRQHandler                             ;USDHC1
        DCD     USDHC2_IRQHandler                             ;USDHC2
        DCD     Reserved104_IRQHandler                        ;Reserved interrupt
        DCD     TMR2_IRQHandler                               ;TMR2 interrupt
        DCD     LDO_1P0_IRQHandler                            ;LDO 1P8 interrupt
        DCD     MECC1_IRQHandler                              ;MECC1 interrupt
        DCD     MECC2_IRQHandler                              ;MECC2 interrupt
        DCD     ADC1_IRQHandler                               ;ADC1 interrupt
        DCD     DMA_ERROR_IRQHandler                          ;DMA error interrupt
        DCD     DMA_0_IRQHandler                              ;DMA channel 0 interrupt
        DCD     DMA_1_IRQHandler                              ;DMA channel 1 interrupt
        DCD     DMA_2_IRQHandler                              ;DMA channel 2 interrupt
        DCD     DMA_3_IRQHandler                              ;DMA channel 3 interrupt
        DCD     DMA_4_IRQHandler                              ;DMA channel 4 interrupt
        DCD     DMA_5_IRQHandler                              ;DMA channel 5 interrupt
        DCD     DMA_6_IRQHandler                              ;DMA channel 6 interrupt
        DCD     DMA_7_IRQHandler                              ;DMA channel 7 interrupt
        DCD     DMA_8_IRQHandler                              ;DMA channel 8 interrupt
        DCD     DMA_9_IRQHandler                              ;DMA channel 9 interrupt
        DCD     DMA_10_IRQHandler                             ;DMA channel 10 interrupt
        DCD     DMA_11_IRQHandler                             ;DMA channel 11 interrupt
        DCD     DMA_12_IRQHandler                             ;DMA channel 12 interrupt
        DCD     DMA_13_IRQHandler                             ;DMA channel 13 interrupt
        DCD     DMA_14_IRQHandler                             ;DMA channel 14 interrupt
        DCD     DMA_15_IRQHandler                             ;DMA channel 15 interrupt
        DCD     DMA_16_IRQHandler                             ;DMA channel 16 interrupt
        DCD     DMA_17_IRQHandler                             ;DMA channel 17 interrupt
        DCD     DMA_18_IRQHandler                             ;DMA channel 18 interrupt
        DCD     DMA_19_IRQHandler                             ;DMA channel 19 interrupt
        DCD     DMA_20_IRQHandler                             ;DMA channel 20 interrupt
        DCD     DMA_21_IRQHandler                             ;DMA channel 21 interrupt
        DCD     DMA_22_IRQHandler                             ;DMA channel 22 interrupt
        DCD     DMA_23_IRQHandler                             ;DMA channel 23 interrupt
        DCD     DMA_24_IRQHandler                             ;DMA channel 24 interrupt
        DCD     DMA_25_IRQHandler                             ;DMA channel 25 interrupt
        DCD     DMA_26_IRQHandler                             ;DMA channel 26 interrupt
        DCD     DMA_27_IRQHandler                             ;DMA channel 27 interrupt
        DCD     DMA_28_IRQHandler                             ;DMA channel 28 interrupt
        DCD     DMA_29_IRQHandler                             ;DMA channel 29 interrupt
        DCD     DMA_30_IRQHandler                             ;DMA channel 30 interrupt
        DCD     DMA_31_IRQHandler                             ;DMA channel 31 interrupt
        DCD     DMA4_ERROR_IRQHandler                         ;DMA error interrupt
        DCD     DMA4_0_1_IRQHandler                           ;DMA channel 0/1 interrupt
        DCD     DMA4_2_3_IRQHandler                           ;DMA channel 2/3 interrupt
        DCD     DMA4_4_5_IRQHandler                           ;DMA channel 4/5 interrupt
        DCD     DMA4_6_7_IRQHandler                           ;DMA channel 6/7 interrupt
        DCD     DMA4_8_9_IRQHandler                           ;DMA channel 8/9 interrupt
        DCD     DMA4_10_11_IRQHandler                         ;DMA channel 10/11 interrupt
        DCD     DMA4_12_13_IRQHandler                         ;DMA channel 12/13 interrupt
        DCD     DMA4_14_15_IRQHandler                         ;DMA channel 14/15 interrupt
        DCD     DMA4_16_17_IRQHandler                         ;DMA channel 16/17 interrupt
        DCD     DMA4_18_19_IRQHandler                         ;DMA channel 18/19 interrupt
        DCD     DMA4_20_21_IRQHandler                         ;DMA channel 20/21 interrupt
        DCD     DMA4_22_23_IRQHandler                         ;DMA channel 22/23 interrupt
        DCD     DMA4_24_25_IRQHandler                         ;DMA channel 24/25 interrupt
        DCD     DMA4_26_27_IRQHandler                         ;DMA channel 26/27 interrupt
        DCD     DMA4_28_29_IRQHandler                         ;DMA channel 28/29 interrupt
        DCD     DMA4_30_31_IRQHandler                         ;DMA channel 30/31 interrupt
        DCD     Reserved160_IRQHandler                        ;Reserved interrupt
        DCD     Reserved161_IRQHandler                        ;Reserved interrupt
        DCD     Reserved162_IRQHandler                        ;Reserved interrupt
        DCD     Reserved163_IRQHandler                        ;Reserved interrupt
        DCD     Reserved164_IRQHandler                        ;Reserved interrupt
        DCD     Reserved165_IRQHandler                        ;Reserved interrupt
        DCD     Reserved166_IRQHandler                        ;Reserved interrupt
        DCD     Reserved167_IRQHandler                        ;Reserved interrupt
        DCD     LPI2C5_IRQHandler                             ;LPI2C5 interrupt
        DCD     LPI2C6_IRQHandler                             ;LPI2C6 interrupt
        DCD     SAI4_IRQHandler                               ;SAI4 interrupt
        DCD     SPDIF_IRQHandler                              ;SPDIF interrupt
        DCD     LPUART9_IRQHandler                            ;LPUART9 interrupt
        DCD     LPUART10_IRQHandler                           ;LPUART10 interrupt
        DCD     LPUART11_IRQHandler                           ;LPUART11 interrupt
        DCD     LPUART12_IRQHandler                           ;LPUART12 interrupt
        DCD     Reserved176_IRQHandler                        ;Reserved interrupt
        DCD     Reserved177_IRQHandler                        ;Reserved interrupt
        DCD     Reserved178_IRQHandler                        ;Reserved interrupt
        DCD     Reserved179_IRQHandler                        ;Reserved interrupt
        DCD     TMR3_IRQHandler                               ;TMR3 interrupt
        DCD     TMR4_IRQHandler                               ;TMR4 interrupt
        DCD     Reserved182_IRQHandler                        ;Reserved interrupt
        DCD     Reserved183_IRQHandler                        ;Reserved interrupt
        DCD     Reserved184_IRQHandler                        ;Reserved interrupt
        DCD     Reserved185_IRQHandler                        ;Reserved interrupt
        DCD     PWM2_FAULT_IRQHandler                         ;PWM2 fault or reload error interrupt
        DCD     PWM2_0_IRQHandler                             ;PWM2 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM2_1_IRQHandler                             ;PWM2 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM2_2_IRQHandler                             ;PWM2 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM2_3_IRQHandler                             ;PWM2 capture 3, compare 3, or reload 3 interrupt
        DCD     PWM3_FAULT_IRQHandler                         ;PWM3 fault or reload error interrupt
        DCD     PWM3_0_IRQHandler                             ;PWM3 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM3_1_IRQHandler                             ;PWM3 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM3_2_IRQHandler                             ;PWM3 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM3_3_IRQHandler                             ;PWM3 capture 3, compare 3, or reload 3 interrupt
        DCD     PWM4_FAULT_IRQHandler                         ;PWM4 fault or reload error interrupt
        DCD     PWM4_0_IRQHandler                             ;PWM4 capture 0, compare 0, or reload 0 interrupt
        DCD     PWM4_1_IRQHandler                             ;PWM4 capture 1, compare 1, or reload 1 interrupt
        DCD     PWM4_2_IRQHandler                             ;PWM4 capture 2, compare 2, or reload 2 interrupt
        DCD     PWM4_3_IRQHandler                             ;PWM4 capture 3, compare 3, or reload 3 interrupt
        DCD     ENC1_IRQHandler                               ;ENC1 interrupt
        DCD     ENC2_IRQHandler                               ;ENC2 interrupt
        DCD     ENC3_IRQHandler                               ;ENC3 interrupt
        DCD     ENC4_IRQHandler                               ;ENC4 interrupt
        DCD     ADC2_IRQHandler                               ;ADC2 interrupt
        DCD     DCDC_IRQHandler                               ;DCDC interrupt
        DCD     CAN3_IRQHandler                               ;CAN3 interrupt
        DCD     CAN3_ERROR_IRQHandler                         ;CAN3 error interrupt
        DCD     DAC_IRQHandler                                ;DAC interrupt
        DCD     LPSPI5_IRQHandler                             ;LPSPI5 interrupt
        DCD     LPSPI6_IRQHandler                             ;LPSPI6 interrupt
        DCD     LPUART7_IRQHandler                            ;LPUART7 interrupt
        DCD     LPUART8_IRQHandler                            ;LPUART8 interrupt
        DCD     SAI2_IRQHandler                               ;SAI2 interrupt
        DCD     SAI3_IRQHandler                               ;SAI3 interrupt
        DCD     ACMP1_IRQHandler                              ;CMP1 interrupt
        DCD     ACMP2_IRQHandler                              ;CMP2 interrupt
        DCD     ACMP3_IRQHandler                              ;CMP3 interrupt
        DCD     ACMP4_IRQHandler                              ;CMP4 interrupt
        DCD     Reserved220_IRQHandler                        ;Reserved interrupt
        DCD     Reserved221_IRQHandler                        ;Reserved interrupt
        DCD     Reserved222_IRQHandler                        ;Reserved interrupt
        DCD     Reserved223_IRQHandler                        ;Reserved interrupt
        DCD     Reserved224_IRQHandler                        ;Reserved interrupt
        DCD     GPT1_IRQHandler                               ;GPT1 interrupt
        DCD     GPT2_IRQHandler                               ;GPT2 interrupt
        DCD     KPP_IRQHandler                                ;KPP interrupt
        DCD     USBPHY1_IRQHandler                            ;USBPHY1 interrupt
        DCD     USBPHY2_IRQHandler                            ;USBPHY2 interrupt
        DCD     USB_OTG2_IRQHandler                           ;USBOTG2 interrupt
        DCD     USB_OTG1_IRQHandler                           ;USBOTG1 interrupt
        DCD     XSPI_SLV_IRQHandler                           ;XSPI_SLV interrupt
        DCD     NETC_IRQHandler                               ;NETC interrupt
        DCD     Reserved234_IRQHandler                        ;Reserved interrupt
        DCD     Reserved235_IRQHandler                        ;Reserved interrupt
        DCD     Reserved236_IRQHandler                        ;Reserved interrupt
        DCD     Reserved237_IRQHandler                        ;Reserved interrupt
        DCD     Reserved238_IRQHandler                        ;Reserved interrupt
        DCD     Reserved239_IRQHandler                        ;Reserved interrupt
        DCD     SINC1_0_IRQHandler                            ;SINC Filter Glue 1 channel 0
        DCD     SINC1_1_IRQHandler                            ;SINC Filter Glue 1 channel 1
        DCD     SINC1_2_IRQHandler                            ;SINC Filter Glue 1 channel 2
        DCD     SINC1_3_IRQHandler                            ;SINC Filter Glue 1 channel 3
        DCD     SINC2_0_IRQHandler                            ;SINC Filter Glue 2 channel 0
        DCD     SINC2_1_IRQHandler                            ;SINC Filter Glue 2 channel 1
        DCD     SINC2_2_IRQHandler                            ;SINC Filter Glue 2 channel 2
        DCD     SINC2_3_IRQHandler                            ;SINC Filter Glue 2 channel 3
        DCD     GPIO4_0_IRQHandler                            ;GPIO4 interrupt 0
        DCD     GPIO4_1_IRQHandler                            ;GPIO4 interrupt 1
        DCD     GPIO5_0_IRQHandler                            ;GPIO5 interrupt 0
        DCD     GPIO5_1_IRQHandler                            ;GPIO5 interrupt 1
        DCD     GPIO6_0_IRQHandler                            ;GPIO6 interrupt 0
        DCD     GPIO6_1_IRQHandler                            ;GPIO6 interrupt 1
        DCD     Reserved254_IRQHandler                        ;Reserved interrupt
        DCD     Reserved255_IRQHandler                        ;Reserved interrupt
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

