JayHeng/RT-UFL/test/unittest/MIMXRT1189/startup_MIMXRT1189_cm33.s
        PUBWEAK LPI2C4_IRQHandler
        PUBWEAK LPI2C4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C4_IRQHandler
        LDR     R0, =LPI2C4_DriverIRQHandler
        BX      R0

        PUBWEAK LPIT2_IRQHandler
        PUBWEAK LPSPI3_IRQHandler
        PUBWEAK LPSPI3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI3_IRQHandler
        LDR     R0, =LPSPI3_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI4_IRQHandler
        PUBWEAK LPSPI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI4_IRQHandler
        LDR     R0, =LPSPI4_DriverIRQHandler
        BX      R0

        PUBWEAK LPTMR2_IRQHandler
        PUBWEAK LPUART3_IRQHandler
        PUBWEAK LPUART3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART3_IRQHandler
        LDR     R0, =LPUART3_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART4_IRQHandler
        PUBWEAK LPUART4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART4_IRQHandler
        LDR     R0, =LPUART4_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART5_IRQHandler
        PUBWEAK LPUART5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART5_IRQHandler
        LDR     R0, =LPUART5_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART6_IRQHandler
        PUBWEAK LPUART6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART6_IRQHandler
        LDR     R0, =LPUART6_DriverIRQHandler
        BX      R0

        PUBWEAK ASRC_IRQHandler
        PUBWEAK ASRC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ASRC_IRQHandler
        LDR     R0, =ASRC_DriverIRQHandler
        BX      R0

        PUBWEAK BBNSM_IRQHandler
        PUBWEAK SYS_CTRL1_IRQHandler
        PUBWEAK TPM3_IRQHandler
        PUBWEAK TPM4_IRQHandler
        PUBWEAK TPM5_IRQHandler
        PUBWEAK TPM6_IRQHandler
        PUBWEAK RTWDOG3_IRQHandler
        PUBWEAK RTWDOG4_IRQHandler
        PUBWEAK RTWDOG5_IRQHandler
        PUBWEAK Reserved98_IRQHandler
        PUBWEAK TEMPSENSOR_IRQHandler
        PUBWEAK BBSM_ALARM_IRQHandler
        PUBWEAK Reserved101_IRQHandler
        PUBWEAK USDHC1_IRQHandler
        PUBWEAK USDHC1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC1_IRQHandler
        LDR     R0, =USDHC1_DriverIRQHandler
        BX      R0

        PUBWEAK USDHC2_IRQHandler
        PUBWEAK USDHC2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC2_IRQHandler
        LDR     R0, =USDHC2_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved104_IRQHandler
        PUBWEAK TMR2_IRQHandler
        PUBWEAK LDO_1P0_IRQHandler
        PUBWEAK MECC1_IRQHandler
        PUBWEAK MECC2_IRQHandler
        PUBWEAK ADC1_IRQHandler
        PUBWEAK DMA_ERROR_IRQHandler
        PUBWEAK DMA_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_ERROR_IRQHandler
        LDR     R0, =DMA_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_0_IRQHandler
        PUBWEAK DMA_0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_0_IRQHandler
        LDR     R0, =DMA_0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_1_IRQHandler
        PUBWEAK DMA_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_1_IRQHandler
        LDR     R0, =DMA_1_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_2_IRQHandler
        PUBWEAK DMA_2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_2_IRQHandler
        LDR     R0, =DMA_2_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_3_IRQHandler
        PUBWEAK DMA_3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_3_IRQHandler
        LDR     R0, =DMA_3_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_4_IRQHandler
        PUBWEAK DMA_4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_4_IRQHandler
        LDR     R0, =DMA_4_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_5_IRQHandler
        PUBWEAK DMA_5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_5_IRQHandler
        LDR     R0, =DMA_5_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_6_IRQHandler
        PUBWEAK DMA_6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_6_IRQHandler
        LDR     R0, =DMA_6_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_7_IRQHandler
        PUBWEAK DMA_7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_7_IRQHandler
        LDR     R0, =DMA_7_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_8_IRQHandler
        PUBWEAK DMA_8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_8_IRQHandler
        LDR     R0, =DMA_8_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_9_IRQHandler
        PUBWEAK DMA_9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_9_IRQHandler
        LDR     R0, =DMA_9_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_10_IRQHandler
        PUBWEAK DMA_10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_10_IRQHandler
        LDR     R0, =DMA_10_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_11_IRQHandler
        PUBWEAK DMA_11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_11_IRQHandler
        LDR     R0, =DMA_11_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_12_IRQHandler
        PUBWEAK DMA_12_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_12_IRQHandler
        LDR     R0, =DMA_12_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_13_IRQHandler
        PUBWEAK DMA_13_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_13_IRQHandler
        LDR     R0, =DMA_13_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_14_IRQHandler
        PUBWEAK DMA_14_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_14_IRQHandler
        LDR     R0, =DMA_14_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_15_IRQHandler
        PUBWEAK DMA_15_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_15_IRQHandler
        LDR     R0, =DMA_15_DriverIRQHandler
        BX      R0

