JayHeng/RT-UFL/test/unittest/MIMXRT1189/startup_MIMXRT1189_cm33.s
        PUBWEAK DMA_16_IRQHandler
        PUBWEAK DMA_16_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_16_IRQHandler
        LDR     R0, =DMA_16_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_17_IRQHandler
        PUBWEAK DMA_17_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_17_IRQHandler
        LDR     R0, =DMA_17_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_18_IRQHandler
        PUBWEAK DMA_18_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_18_IRQHandler
        LDR     R0, =DMA_18_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_19_IRQHandler
        PUBWEAK DMA_19_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_19_IRQHandler
        LDR     R0, =DMA_19_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_20_IRQHandler
        PUBWEAK DMA_20_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_20_IRQHandler
        LDR     R0, =DMA_20_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_21_IRQHandler
        PUBWEAK DMA_21_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_21_IRQHandler
        LDR     R0, =DMA_21_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_22_IRQHandler
        PUBWEAK DMA_22_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_22_IRQHandler
        LDR     R0, =DMA_22_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_23_IRQHandler
        PUBWEAK DMA_23_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_23_IRQHandler
        LDR     R0, =DMA_23_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_24_IRQHandler
        PUBWEAK DMA_24_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_24_IRQHandler
        LDR     R0, =DMA_24_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_25_IRQHandler
        PUBWEAK DMA_25_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_25_IRQHandler
        LDR     R0, =DMA_25_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_26_IRQHandler
        PUBWEAK DMA_26_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_26_IRQHandler
        LDR     R0, =DMA_26_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_27_IRQHandler
        PUBWEAK DMA_27_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_27_IRQHandler
        LDR     R0, =DMA_27_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_28_IRQHandler
        PUBWEAK DMA_28_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_28_IRQHandler
        LDR     R0, =DMA_28_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_29_IRQHandler
        PUBWEAK DMA_29_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_29_IRQHandler
        LDR     R0, =DMA_29_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_30_IRQHandler
        PUBWEAK DMA_30_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_30_IRQHandler
        LDR     R0, =DMA_30_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_31_IRQHandler
        PUBWEAK DMA_31_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_31_IRQHandler
        LDR     R0, =DMA_31_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_ERROR_IRQHandler
        PUBWEAK DMA4_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_ERROR_IRQHandler
        LDR     R0, =DMA4_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_0_1_IRQHandler
        PUBWEAK DMA4_0_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_0_1_IRQHandler
        LDR     R0, =DMA4_0_1_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_2_3_IRQHandler
        PUBWEAK DMA4_2_3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_2_3_IRQHandler
        LDR     R0, =DMA4_2_3_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_4_5_IRQHandler
        PUBWEAK DMA4_4_5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_4_5_IRQHandler
        LDR     R0, =DMA4_4_5_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_6_7_IRQHandler
        PUBWEAK DMA4_6_7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_6_7_IRQHandler
        LDR     R0, =DMA4_6_7_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_8_9_IRQHandler
        PUBWEAK DMA4_8_9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_8_9_IRQHandler
        LDR     R0, =DMA4_8_9_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_10_11_IRQHandler
        PUBWEAK DMA4_10_11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_10_11_IRQHandler
        LDR     R0, =DMA4_10_11_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_12_13_IRQHandler
        PUBWEAK DMA4_12_13_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_12_13_IRQHandler
        LDR     R0, =DMA4_12_13_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_14_15_IRQHandler
        PUBWEAK DMA4_14_15_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_14_15_IRQHandler
        LDR     R0, =DMA4_14_15_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_16_17_IRQHandler
        PUBWEAK DMA4_16_17_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_16_17_IRQHandler
        LDR     R0, =DMA4_16_17_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_18_19_IRQHandler
        PUBWEAK DMA4_18_19_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_18_19_IRQHandler
        LDR     R0, =DMA4_18_19_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_20_21_IRQHandler
        PUBWEAK DMA4_20_21_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_20_21_IRQHandler
        LDR     R0, =DMA4_20_21_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_22_23_IRQHandler
        PUBWEAK DMA4_22_23_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_22_23_IRQHandler
        LDR     R0, =DMA4_22_23_DriverIRQHandler
        BX      R0

