JayHeng/RT-UFL/test/unittest/MIMXRT1189/startup_MIMXRT1189_cm33.s
        PUBWEAK DMA4_24_25_IRQHandler
        PUBWEAK DMA4_24_25_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_24_25_IRQHandler
        LDR     R0, =DMA4_24_25_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_26_27_IRQHandler
        PUBWEAK DMA4_26_27_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_26_27_IRQHandler
        LDR     R0, =DMA4_26_27_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_28_29_IRQHandler
        PUBWEAK DMA4_28_29_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_28_29_IRQHandler
        LDR     R0, =DMA4_28_29_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_30_31_IRQHandler
        PUBWEAK DMA4_30_31_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_30_31_IRQHandler
        LDR     R0, =DMA4_30_31_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved160_IRQHandler
        PUBWEAK Reserved161_IRQHandler
        PUBWEAK Reserved162_IRQHandler
        PUBWEAK Reserved163_IRQHandler
        PUBWEAK Reserved164_IRQHandler
        PUBWEAK Reserved165_IRQHandler
        PUBWEAK Reserved166_IRQHandler
        PUBWEAK Reserved167_IRQHandler
        PUBWEAK LPI2C5_IRQHandler
        PUBWEAK LPI2C5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C5_IRQHandler
        LDR     R0, =LPI2C5_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C6_IRQHandler
        PUBWEAK LPI2C6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C6_IRQHandler
        LDR     R0, =LPI2C6_DriverIRQHandler
        BX      R0

        PUBWEAK SAI4_IRQHandler
        PUBWEAK SAI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI4_IRQHandler
        LDR     R0, =SAI4_DriverIRQHandler
        BX      R0

        PUBWEAK SPDIF_IRQHandler
        PUBWEAK SPDIF_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SPDIF_IRQHandler
        LDR     R0, =SPDIF_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART9_IRQHandler
        PUBWEAK LPUART9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART9_IRQHandler
        LDR     R0, =LPUART9_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART10_IRQHandler
        PUBWEAK LPUART10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART10_IRQHandler
        LDR     R0, =LPUART10_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART11_IRQHandler
        PUBWEAK LPUART11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART11_IRQHandler
        LDR     R0, =LPUART11_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART12_IRQHandler
        PUBWEAK LPUART12_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART12_IRQHandler
        LDR     R0, =LPUART12_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved176_IRQHandler
        PUBWEAK Reserved177_IRQHandler
        PUBWEAK Reserved178_IRQHandler
        PUBWEAK Reserved179_IRQHandler
        PUBWEAK TMR3_IRQHandler
        PUBWEAK TMR4_IRQHandler
        PUBWEAK Reserved182_IRQHandler
        PUBWEAK Reserved183_IRQHandler
        PUBWEAK Reserved184_IRQHandler
        PUBWEAK Reserved185_IRQHandler
        PUBWEAK PWM2_FAULT_IRQHandler
        PUBWEAK PWM2_0_IRQHandler
        PUBWEAK PWM2_1_IRQHandler
        PUBWEAK PWM2_2_IRQHandler
        PUBWEAK PWM2_3_IRQHandler
        PUBWEAK PWM3_FAULT_IRQHandler
        PUBWEAK PWM3_0_IRQHandler
        PUBWEAK PWM3_1_IRQHandler
        PUBWEAK PWM3_2_IRQHandler
        PUBWEAK PWM3_3_IRQHandler
        PUBWEAK PWM4_FAULT_IRQHandler
        PUBWEAK PWM4_0_IRQHandler
        PUBWEAK PWM4_1_IRQHandler
        PUBWEAK PWM4_2_IRQHandler
        PUBWEAK PWM4_3_IRQHandler
        PUBWEAK ENC1_IRQHandler
        PUBWEAK ENC2_IRQHandler
        PUBWEAK ENC3_IRQHandler
        PUBWEAK ENC4_IRQHandler
        PUBWEAK ADC2_IRQHandler
        PUBWEAK DCDC_IRQHandler
        PUBWEAK CAN3_IRQHandler
        PUBWEAK CAN3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN3_IRQHandler
        LDR     R0, =CAN3_DriverIRQHandler
        BX      R0

        PUBWEAK CAN3_ERROR_IRQHandler
        PUBWEAK CAN3_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN3_ERROR_IRQHandler
        LDR     R0, =CAN3_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DAC_IRQHandler
        PUBWEAK LPSPI5_IRQHandler
        PUBWEAK LPSPI5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI5_IRQHandler
        LDR     R0, =LPSPI5_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI6_IRQHandler
        PUBWEAK LPSPI6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI6_IRQHandler
        LDR     R0, =LPSPI6_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART7_IRQHandler
        PUBWEAK LPUART7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART7_IRQHandler
        LDR     R0, =LPUART7_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART8_IRQHandler
        PUBWEAK LPUART8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART8_IRQHandler
        LDR     R0, =LPUART8_DriverIRQHandler
        BX      R0

        PUBWEAK SAI2_IRQHandler
        PUBWEAK SAI2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI2_IRQHandler
        LDR     R0, =SAI2_DriverIRQHandler
        BX      R0

        PUBWEAK SAI3_IRQHandler
        PUBWEAK SAI3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI3_IRQHandler
        LDR     R0, =SAI3_DriverIRQHandler
        BX      R0

        PUBWEAK ACMP1_IRQHandler
        PUBWEAK ACMP2_IRQHandler
        PUBWEAK ACMP3_IRQHandler
        PUBWEAK ACMP4_IRQHandler
        PUBWEAK Reserved220_IRQHandler
        PUBWEAK Reserved221_IRQHandler
        PUBWEAK Reserved222_IRQHandler
        PUBWEAK Reserved223_IRQHandler
        PUBWEAK Reserved224_IRQHandler
        PUBWEAK GPT1_IRQHandler
        PUBWEAK GPT2_IRQHandler
        PUBWEAK KPP_IRQHandler
        PUBWEAK USBPHY1_IRQHandler
        PUBWEAK USBPHY2_IRQHandler
        PUBWEAK USB_OTG2_IRQHandler
        PUBWEAK USB_OTG1_IRQHandler
        PUBWEAK XSPI_SLV_IRQHandler
        PUBWEAK XSPI_SLV_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
XSPI_SLV_IRQHandler
        LDR     R0, =XSPI_SLV_DriverIRQHandler
        BX      R0

        PUBWEAK NETC_IRQHandler
        PUBWEAK Reserved234_IRQHandler
        PUBWEAK Reserved235_IRQHandler
        PUBWEAK Reserved236_IRQHandler
        PUBWEAK Reserved237_IRQHandler
        PUBWEAK Reserved238_IRQHandler
        PUBWEAK Reserved239_IRQHandler
        PUBWEAK SINC1_0_IRQHandler
        PUBWEAK SINC1_1_IRQHandler
        PUBWEAK SINC1_2_IRQHandler
        PUBWEAK SINC1_3_IRQHandler
        PUBWEAK SINC2_0_IRQHandler
        PUBWEAK SINC2_1_IRQHandler
        PUBWEAK SINC2_2_IRQHandler
        PUBWEAK SINC2_3_IRQHandler
        PUBWEAK GPIO4_0_IRQHandler
        PUBWEAK GPIO4_1_IRQHandler
        PUBWEAK GPIO5_0_IRQHandler
        PUBWEAK GPIO5_1_IRQHandler
        PUBWEAK GPIO6_0_IRQHandler
        PUBWEAK GPIO6_1_IRQHandler
        PUBWEAK Reserved254_IRQHandler
        PUBWEAK Reserved255_IRQHandler
        PUBWEAK DefaultISR
        SECTION .text:CODE:REORDER:NOROOT(1)
TMR1_IRQHandler
DGB_TRACE_IRQHandler
CTI_TRIGGER_OUT_CM7_IRQHandler
CTI_TRIGGER_OUT_CM33_IRQHandler
TMR5_IRQHandler
TMR6_IRQHandler
TMR7_IRQHandler
TMR8_IRQHandler
CAN1_DriverIRQHandler
CAN1_ERROR_DriverIRQHandler
GPIO1_0_IRQHandler
GPIO1_1_IRQHandler
Reserved28_IRQHandler
LPI2C1_DriverIRQHandler
LPI2C2_DriverIRQHandler
LPIT1_IRQHandler
LPSPI1_DriverIRQHandler
LPSPI2_DriverIRQHandler
LPTMR1_IRQHandler
LPUART1_DriverIRQHandler
LPUART2_DriverIRQHandler
Reserved37_IRQHandler
Reserved38_IRQHandler
PWM1_FAULT_IRQHandler
PWM1_0_IRQHandler
PWM1_1_IRQHandler
PWM1_2_IRQHandler
PWM1_3_IRQHandler
Reserved44_IRQHandler
Reserved45_IRQHandler
Reserved46_IRQHandler
Reserved47_IRQHandler
Reserved48_IRQHandler
Reserved49_IRQHandler
Reserved50_IRQHandler
Reserved51_IRQHandler
TPM1_IRQHandler
TPM2_IRQHandler
RTWDOG1_IRQHandler
RTWDOG2_IRQHandler
Reserved56_IRQHandler
PDM_HWVAD_EVENT_DriverIRQHandler
PDM_HWVAD_ERROR_DriverIRQHandler
PDM_EVENT_DriverIRQHandler
PDM_ERROR_DriverIRQHandler
SAI1_DriverIRQHandler
CACHE_ECC_IRQHandler
M33_TCM_ECC_IRQHandler
M33_TCM_ERROR_IRQHandler
M7_TCM_ECC_IRQHandler
M7_TCM_ERROR_IRQHandler
CAN2_DriverIRQHandler
CAN2_ERROR_DriverIRQHandler
FLEXIO1_DriverIRQHandler
FLEXIO2_DriverIRQHandler
FLEXSPI1_DriverIRQHandler
FLEXSPI2_DriverIRQHandler
GPIO2_0_IRQHandler
GPIO2_1_IRQHandler
GPIO3_0_IRQHandler
GPIO3_1_IRQHandler
Reserved77_IRQHandler
LPI2C3_DriverIRQHandler
LPI2C4_DriverIRQHandler
LPIT2_IRQHandler
LPSPI3_DriverIRQHandler
LPSPI4_DriverIRQHandler
LPTMR2_IRQHandler
LPUART3_DriverIRQHandler
LPUART4_DriverIRQHandler
LPUART5_DriverIRQHandler
LPUART6_DriverIRQHandler
ASRC_DriverIRQHandler
BBNSM_IRQHandler
SYS_CTRL1_IRQHandler
TPM3_IRQHandler
TPM4_IRQHandler
TPM5_IRQHandler
TPM6_IRQHandler
RTWDOG3_IRQHandler
RTWDOG4_IRQHandler
RTWDOG5_IRQHandler
Reserved98_IRQHandler
TEMPSENSOR_IRQHandler
BBSM_ALARM_IRQHandler
Reserved101_IRQHandler
USDHC1_DriverIRQHandler
USDHC2_DriverIRQHandler
Reserved104_IRQHandler
TMR2_IRQHandler
LDO_1P0_IRQHandler
MECC1_IRQHandler
MECC2_IRQHandler
ADC1_IRQHandler
DMA_ERROR_DriverIRQHandler
DMA_0_DriverIRQHandler
DMA_1_DriverIRQHandler
DMA_2_DriverIRQHandler
DMA_3_DriverIRQHandler
DMA_4_DriverIRQHandler
DMA_5_DriverIRQHandler
DMA_6_DriverIRQHandler
DMA_7_DriverIRQHandler
DMA_8_DriverIRQHandler
DMA_9_DriverIRQHandler
DMA_10_DriverIRQHandler
DMA_11_DriverIRQHandler
DMA_12_DriverIRQHandler
DMA_13_DriverIRQHandler
DMA_14_DriverIRQHandler
DMA_15_DriverIRQHandler
DMA_16_DriverIRQHandler
DMA_17_DriverIRQHandler
DMA_18_DriverIRQHandler
DMA_19_DriverIRQHandler
DMA_20_DriverIRQHandler
DMA_21_DriverIRQHandler
DMA_22_DriverIRQHandler
DMA_23_DriverIRQHandler
DMA_24_DriverIRQHandler
DMA_25_DriverIRQHandler
DMA_26_DriverIRQHandler
DMA_27_DriverIRQHandler
DMA_28_DriverIRQHandler
DMA_29_DriverIRQHandler
DMA_30_DriverIRQHandler
DMA_31_DriverIRQHandler
DMA4_ERROR_DriverIRQHandler
DMA4_0_1_DriverIRQHandler
DMA4_2_3_DriverIRQHandler
DMA4_4_5_DriverIRQHandler
DMA4_6_7_DriverIRQHandler
DMA4_8_9_DriverIRQHandler
DMA4_10_11_DriverIRQHandler
DMA4_12_13_DriverIRQHandler
DMA4_14_15_DriverIRQHandler
DMA4_16_17_DriverIRQHandler
DMA4_18_19_DriverIRQHandler
DMA4_20_21_DriverIRQHandler
DMA4_22_23_DriverIRQHandler
DMA4_24_25_DriverIRQHandler
DMA4_26_27_DriverIRQHandler
DMA4_28_29_DriverIRQHandler
DMA4_30_31_DriverIRQHandler
Reserved160_IRQHandler
Reserved161_IRQHandler
Reserved162_IRQHandler
Reserved163_IRQHandler
Reserved164_IRQHandler
Reserved165_IRQHandler
Reserved166_IRQHandler
Reserved167_IRQHandler
LPI2C5_DriverIRQHandler
LPI2C6_DriverIRQHandler
SAI4_DriverIRQHandler
SPDIF_DriverIRQHandler
LPUART9_DriverIRQHandler
LPUART10_DriverIRQHandler
LPUART11_DriverIRQHandler
LPUART12_DriverIRQHandler
Reserved176_IRQHandler
Reserved177_IRQHandler
Reserved178_IRQHandler
Reserved179_IRQHandler
TMR3_IRQHandler
TMR4_IRQHandler
Reserved182_IRQHandler
Reserved183_IRQHandler
Reserved184_IRQHandler
Reserved185_IRQHandler
PWM2_FAULT_IRQHandler
PWM2_0_IRQHandler
PWM2_1_IRQHandler
PWM2_2_IRQHandler
PWM2_3_IRQHandler
PWM3_FAULT_IRQHandler
PWM3_0_IRQHandler
PWM3_1_IRQHandler
PWM3_2_IRQHandler
PWM3_3_IRQHandler
PWM4_FAULT_IRQHandler
PWM4_0_IRQHandler
PWM4_1_IRQHandler
PWM4_2_IRQHandler
PWM4_3_IRQHandler
ENC1_IRQHandler
ENC2_IRQHandler
ENC3_IRQHandler
ENC4_IRQHandler
ADC2_IRQHandler
DCDC_IRQHandler
CAN3_DriverIRQHandler
CAN3_ERROR_DriverIRQHandler
DAC_IRQHandler
LPSPI5_DriverIRQHandler
LPSPI6_DriverIRQHandler
LPUART7_DriverIRQHandler
LPUART8_DriverIRQHandler
SAI2_DriverIRQHandler
SAI3_DriverIRQHandler
ACMP1_IRQHandler
ACMP2_IRQHandler
ACMP3_IRQHandler
ACMP4_IRQHandler
Reserved220_IRQHandler
Reserved221_IRQHandler
Reserved222_IRQHandler
Reserved223_IRQHandler
Reserved224_IRQHandler
GPT1_IRQHandler
GPT2_IRQHandler
KPP_IRQHandler
USBPHY1_IRQHandler
USBPHY2_IRQHandler
USB_OTG2_IRQHandler
USB_OTG1_IRQHandler
XSPI_SLV_DriverIRQHandler
NETC_IRQHandler
Reserved234_IRQHandler
Reserved235_IRQHandler
Reserved236_IRQHandler
Reserved237_IRQHandler
Reserved238_IRQHandler
Reserved239_IRQHandler
SINC1_0_IRQHandler
SINC1_1_IRQHandler
SINC1_2_IRQHandler
SINC1_3_IRQHandler
SINC2_0_IRQHandler
SINC2_1_IRQHandler
SINC2_2_IRQHandler
SINC2_3_IRQHandler
GPIO4_0_IRQHandler
GPIO4_1_IRQHandler
GPIO5_0_IRQHandler
GPIO5_1_IRQHandler
GPIO6_0_IRQHandler
GPIO6_1_IRQHandler
Reserved254_IRQHandler
Reserved255_IRQHandler
DefaultISR
        B DefaultISR

        END
